// 暫時沒有更新的需求，因此沒有跟部落格一樣存入資料庫，未來會用別的形式呈現。

export const projectInfoData = {
  breeze: {
    title: `當我們望春風：
臺灣流行音樂90年特展`,
    link: 'https://vr.nmth.gov.tw/lookingforwardtospring/',
    img: 'breeze.jpg',
    museum: '國立臺灣歷史博物館',
    jd: `負責所有 UI 介面的切版工作，包括首頁、一般環景及 3D 虛擬展廳的實作。
編寫環景控制邏輯與字幕程序。
開發音樂播放器功能。
管理場景中所有互動元素的顯示與隱藏。`,
    intro: `當我們望春風，所盼的、所望的，究竟是什麼呢……
這是一首歌的故事，更是近代臺灣的一部文化史。
這麼多的〈望春風〉齊聚一堂，在你面前展開的，是一條臺灣流行音樂的長河，也會讓你聽到，這島嶼上來來去去的人們，對現在與未來，曾經有過怎麼樣的慾念和想像。`,
  },
  fortune: {
    title: `好運連連－
財神與蒙藏生活藝術之美特展`,
    link: 'https://vrmtcc.moc.gov.tw/endlessfortune/',
    img: 'fortune.jpg',
    museum: '蒙藏文化中心',
    jd: `負責所有 UI 介面的切版工作，包括首頁和一般環景的實作。
編寫環景控制邏輯。
開發環景穿梭功能套件與切圖小工具，供設計師使用。
管理場景中所有互動元素的顯示與隱藏。`,
    intro: `為了迎接新的一年，文化部蒙藏文化中心特別策辦《好運連連－財神與蒙藏生活藝術之美》特展，以介紹招財祈福的各式財神及蒙藏吉祥文化為主軸，透過文物深刻感受文化藝術具有穩定精神心靈的強大力量，並欣賞不同族群的文化藝術特色。

此次展覽引領觀眾更加認識蒙藏族群豐富多元又獨特美麗的吉祥文物，同時啟發反思探索存在於我們生活周遭的吉祥文化，並尊重不同的宗教信仰。`,
  },
  czech: {
    title: `捷克斯洛伐克X旅人X福爾摩沙1920's特展`,
    link: 'https://vr.nmth.gov.tw/CzechTraveler/',
    img: 'czech.jpg',
    museum: '國立臺灣歷史博物館',
    jd: `負責所有 UI 介面的切版工作，包括首頁、一般環景以及互動小遊戲的實作。
編寫環景控制邏輯，並開發環景穿梭功能套件，供設計師使用。
管理場景中所有互動元素的顯示與隱藏。`,
    game: {
      img: 'czechGame1.jpg',
      content: `這款互動遊戲的設計靈感來自旅行家卜吉比索爾的環島路線。玩家透過遊戲，可以模擬並深入了解當時的旅程。遊戲中還原了高雄到台東以及花蓮到基隆間的交通挑戰，當時這些地區沒有鐵路，必須依靠船隻來往。遊戲會根據玩家的位置安排動畫路線與交通工具，增強整體體驗。`,
    },
    intro: `一次大戰結束後，世界興起民族自決風潮，臺灣也開啟反殖民的政治社會運動，正值臺灣反殖運動熱潮尾端，一個來自一戰後新興國家捷克斯洛伐克的世界旅行家卜吉比索爾，橫跨歐亞大陸，於1929年來到臺灣，見證了殖民政府的言論自由管制，無法自由攝影與行動。
在這種種被限制的背景下，他提出了對於殖民地臺灣的外人觀察，同時也結識了臺灣政治社會運動家蔣渭水跟推行世界語的臺灣同志，當時的臺灣與捷克同屬世界弱小民族，為了對抗強權而展開了短暫但意味深長的交流。`,
  },
  ukrainian: {
    title: `當戰時成為日常：
烏克蘭女性的第_/_天`,
    link: 'https://vr360.nhrm.gov.tw/UkraineWar/',
    img: 'ukrainian.jpg',
    museum: '國家人權博物館',
    jd: `負責所有 UI 介面的切版工作，包括首頁、一般環景的實作。
編寫環景控制邏輯。
開發音樂播放器功能。
管理場景中所有互動元素的顯示與隱藏。`,
    intro: `2022年2月24日，俄羅斯對烏克蘭發動無異於戰爭的「特別軍事行動」，爆發二次世界大戰以來歐洲最大規模的軍事衝突。

此波行動的導火線雖是因烏克蘭欲入北約而起，但實質可溯自2014年克里米亞「公投」入俄和俄國支援烏東分離運動。

2022年大規模軍事衝突爆發後，烏克蘭人展現了全世界都未能預料的持久耐力；而這場原被認為可能很快結束的戰爭，至今已成為烏克蘭人必須適應的日常生活。`,
  },
  gihraf: {
    title: `傾聽裂隙的迴聲`,
    link: 'https://vr360.nhrm.gov.tw/2023gihraf/',
    img: 'gihraf.jpg',
    museum: '國家人權博物館',
    jd: `負責所有 UI 介面的切版工作，包括首頁、一般環景的實作。
編寫環景控制邏輯。
開發音樂播放器功能。
管理場景中所有互動元素的顯示與隱藏。`,
    intro: `2023年綠島人權藝術季「傾聽裂隙的迴聲」選擇了「傾聽」這個看似被動、柔軟的姿態，試圖接收個體所歷經政治、經濟與體制的不同遭遇。經驗後留下的傷口，就像一道道將人們隔開的「裂隙」，加上 fissure 所具有的不協調與分歧的意含，如同白色恐怖於個人與社會帶來的隔閡或差異，在生活推著人們前進時，被略過而有待重新認識。「迴聲」來自於裂隙中不斷發生、傳遞的聲音，而 overtone 是與基礎頻率共同存在的其他頻率，就像主流意見以外被忽略的存在。

「傾聽裂隙的迴聲」以三個子題串連白色恐怖、當代的反思與綠島和人權，希望透過當代藝術拉開與歷史的距離，透過藝術傾聽裂隙裡頭以及另一頭的聲音，在面對複雜且充滿歧異的歷史時，提供觀眾更多想像、思考以及接近的路徑，共同建構這段歷史對於當下的意義。`,
  },
}

export const modelData = [
  {
    id: 'czech',
    name: 'Cube001_1',
    texture: '/model/texture/czechTexture.jpg',
  },
  {
    id: 'ukrainian',
    name: 'Cube001_2',
    texture: '/model/texture/ukrainianTexture.jpg',
  },
  {
    id: 'breeze',
    name: 'Cube001_3',
    texture: '/model/texture/breezeTexture.jpg',
  },
  {
    id: 'gihraf',
    name: 'Cube001_4',
    texture: '/model/texture/gihrafTexture.JPG',
  },
  {
    id: 'fortune',
    name: 'Cube001_5',
    texture: '/model/texture/fortuneTexture.jpg',
  },
  {
    id: 'goBlog',
    name: 'Cube001_6',
    texture: '/model/texture/goBlogTexture.jpg',
  },
]
