// 暫時沒有更新的需求，因此沒有跟部落格一樣存入資料庫，未來會用別的形式呈現。

export const projectInfoData = {
  breeze: {
    title: `當我們望春風：
臺灣流行音樂90年特展`,
    link: 'https://vr.nmth.gov.tw/lookingforwardtospring/',
    img: 'breeze.jpg',
    museum: '國立臺灣歷史博物館',
    jd: `所有 UI 介面切版，包含首頁、一般環景、3D 虛擬展廳。
編寫控制環景邏輯與字幕程序。
控制場內所有互動元素的顯示與隱藏。`,
    intro: `當我們望春風，所盼的、所望的，究竟是什麼呢……
這是一首歌的故事，更是近代臺灣的一部文化史。〈望春風〉這首歌，自創作發表以來，陪伴臺灣人足足90年了，受到三個世代、不同族群的演繹與熱愛，幾乎知名的歌手、歌王歌后都有演唱，版本不計其數，從留聲機、電唱機、收音機、錄音機，播到卡拉OK、CD Player、ipod、手機，發展成歌中劇唱片、戲劇、電影、小說、連續劇、文化節目、雜誌、出版社，是迴盪在空中飄遠的集合哨聲，更是臺灣游子們沉在心底的鄉愁……
這麼多的〈望春風〉齊聚一堂，在你面前展開的，是一條臺灣流行音樂的長河，也會讓你聽到，這島嶼上來來去去的人們，對現在與未來，曾經有過怎麼樣的慾念和想像。`,
  },
  fortune: {
    title: `好運連連－
財神與蒙藏生活藝術之美特展`,
    link: 'https://vrmtcc.moc.gov.tw/endlessfortune/',
    img: 'fortune.jpg',
    museum: '蒙藏文化中心',
    jd: `所有 UI 介面切版，包含首頁、一般環景。
編寫控制環景邏輯，編寫環景穿梭功能套件供設計師使用。
控制場內所有互動元素的顯示與隱藏。`,
    intro: `追求幸福，期盼周遭的人與事物都能趨吉避凶，朝向美好正向的發展，是從古迄今大家共同追求的目標。這種祈求吉祥、期盼圓滿至福的心願，深深地融入全世界各民族或族群的日常生活文化中，用不同信仰或吉祥圖騰具體呈現、各自表述心中願望。這些文化現象包括大家耳熟能詳的吉祥宗教神祇信仰。尤其是馳騁於大草原或高原自然環境的蒙藏族群更是以此為重要的精神依歸，從遠古時期他們逐水草而居，漂泊不定的艱鉅生活，認命又努力的天性，宗教成為最直接的心靈傾訴與實現願望的最大力量，尤其是各式財神信仰及蘊含吉祥寓意的文物，長期發展成為藏傳佛教完整而獨特的生活藝術之美。

為了迎接新的一年，文化部蒙藏文化中心特別策辦《好運連連－財神與蒙藏生活藝術之美》特展，以介紹招財祈福的各式財神及蒙藏吉祥文化為主軸，透過文物深刻感受文化藝術具有穩定精神心靈的強大力量，並欣賞不同族群的文化藝術特色。展覽包括五大單元，從迎接「藏傳佛教各式財神」、普及於蒙藏族群日常生活的「吉祥文物」、展現歡樂佳節氣氛的「蒙古迎新年生活實景」、耀眼奪目且嚮往幸運吉祥象徵的「蒙藏衣服配飾」以及融合傳統文化底蘊與現代創作的「當代藝術與吉祥意涵」，展出將近300件具有吉祥美好意涵的作品，展現傳統與現代兼容並存的特色與和諧美感，並結合數位技術打造沉浸式體驗，提供觀眾虛擬換裝蒙藏服飾，穿越時空華麗變身，呼應藝術超越時空的對話和能量。

此次展覽引領觀眾更加認識蒙藏族群豐富多元又獨特美麗的吉祥文物，同時啟發反思探索存在於我們生活周遭的吉祥文化，並尊重不同的宗教信仰。謹以展覽主題「好運連連」之名，衷心祝福文化藝術傳遞良善的正能量，如同蒙藏文化中的「吉祥結」開啟無限延伸，無限祝福，「好運連連」因此串連起所有人彼此的好運，歡喜迎接新的一年來到！`,
  },
  czech: {
    title: `捷克斯洛伐克X旅人X福爾摩沙1920's特展`,
    link: 'https://vr.nmth.gov.tw/CzechTraveler/',
    img: 'czech.jpg',
    museum: '國立臺灣歷史博物館',
    jd: `所有 UI 介面切版，包含首頁、一般環景、互動小遊戲。
編寫控制環景邏輯，編寫環景穿梭功能套件供設計師使用。
控制場內所有互動元素的顯示與隱藏。`,
    intro: `一次大戰結束後，世界興起民族自決風潮，臺灣也開啟反殖民的政治社會運動，正值臺灣反殖運動熱潮尾端，一個來自一戰後新興國家捷克斯洛伐克的世界旅行家卜吉比索爾，橫跨歐亞大陸，於1929年來到臺灣，見證了殖民政府的言論自由管制，無法自由攝影與行動。
在這種種被限制的背景下，他提出了對於殖民地臺灣的外人觀察，同時也結識了臺灣政治社會運動家蔣渭水跟推行世界語的臺灣同志，當時的臺灣與捷克同屬世界弱小民族，為了對抗強權而展開了短暫但意味深長的交流。`,
  },
  ukrainian: {
    title: `當戰時成為日常：
烏克蘭女性的第_/_天`,
    link: 'https://vr360.nhrm.gov.tw/UkraineWar/',
    img: 'ukrainian.jpg',
    museum: '國家人權博物館',
    jd: `所有 UI 介面切版，包含首頁、一般環景。
編寫控制環景邏輯。
控制場內所有互動元素的顯示與隱藏。`,
    intro: `2022年2月24日，俄羅斯對烏克蘭發動無異於戰爭的「特別軍事行動」，爆發二次世界大戰以來歐洲最大規模的軍事衝突。

此波行動的導火線雖是因烏克蘭欲入北約而起，但實質可溯自2014年克里米亞「公投」入俄和俄國支援烏東分離運動。

2022年大規模軍事衝突爆發後，烏克蘭人展現了全世界都未能預料的持久耐力；而這場原被認為可能很快結束的戰爭，至今已成為烏克蘭人必須適應的日常生活。`,
  },
  gihraf: {
    title: `傾聽裂隙的迴聲`,
    link: 'https://vr360.nhrm.gov.tw/2023gihraf/',
    img: 'gihraf.jpg',
    museum: '國家人權博物館',
    jd: `所有 UI 介面切版，包含首頁、一般環景。
編寫控制環景邏輯。
控制場內所有互動元素的顯示與隱藏。`,
    intro: `2023年綠島人權藝術季「傾聽裂隙的迴聲」選擇了「傾聽」這個看似被動、柔軟的姿態，試圖接收個體所歷經政治、經濟與體制的不同遭遇。經驗後留下的傷口，就像一道道將人們隔開的「裂隙」，加上 fissure 所具有的不協調與分歧的意含，如同白色恐怖於個人與社會帶來的隔閡或差異，在生活推著人們前進時，被略過而有待重新認識。「迴聲」來自於裂隙中不斷發生、傳遞的聲音，而 overtone 是與基礎頻率共同存在的其他頻率，就像主流意見以外被忽略的存在。
        
綠島人權藝術季自2019年開始，今年為第四屆，首次有完整一年的籌備期，透過策展團隊的規劃、組織學術顧問團，開設共學講座、工作坊，踏查、拜訪前輩與後代，與相關人士共同發展和創作。面對白色恐怖複雜的歷史及場域，當代藝術創作與策展的任務不是再現歷史或講述事實，而是透過藝術家的觀點、媒材、創作手法，將對歷史題材的觀察、認識與發現，藉由創作轉化、詮釋、並重新創造出一個觀眾得以接近的路徑。

傾聽與迴聲本為相生的態勢，裂隙的聲音是來自歷史的陷落，抑或至今仍讓大眾難掩不安的傷口？裂隙暗處的嗚鳴聲從來都不只是單一的波動，而是涵納於數萬人的生命經歷。在臺灣極具特色的歷史進程中，威權的代表未被明確地指出為加害者，而彼時的黨國集團在實體與精神上的遺緒，不僅從未失去民意支持，甚至仍掌控著政治與經濟權力。我們要如何讓在白色恐怖這段時間裡，順應體制過著生活，或在當中獲取利益—相較於受迫害者的多數社會—的群體，了解那段歷史與制度的不公義呢？而在這段歷史最具代表性場域之一的綠島，它的文化與故事又是如何被忽略了呢？「傾聽裂隙的迴聲」以三個子題串連白色恐怖、當代的反思與綠島和人權，希望透過當代藝術拉開與歷史的距離，透過藝術傾聽裂隙裡頭以及另一頭的聲音，在面對複雜且充滿歧異的歷史時，提供觀眾更多想像、思考以及接近的路徑，共同建構這段歷史對於當下的意義。`,
  },
}

export const modelData = [
  {
    id: 'czech',
    name: 'Cube001_1',
    texture: '/model/texture/czechTexture.jpg',
  },
  {
    id: 'ukrainian',
    name: 'Cube001_2',
    texture: '/model/texture/ukrainianTexture.jpg',
  },
  {
    id: 'breeze',
    name: 'Cube001_3',
    texture: '/model/texture/breezeTexture.jpg',
  },
  {
    id: 'gihraf',
    name: 'Cube001_4',
    texture: '/model/texture/gihrafTexture.JPG',
  },
  {
    id: 'fortune',
    name: 'Cube001_5',
    texture: '/model/texture/fortuneTexture.jpg',
  },
  {
    id: 'goBlog',
    name: 'Cube001_6',
    texture: '/model/texture/goBlogTexture.jpg',
  },
]
